raw/Dotfile-Management-and-Documentation-with-Org-mode.org
#+URL: https://expoundite.net/guides/dotfile-management

One day 'polm23' asked on Hacker News, [[https://news.ycombinator.com/item?id=11070797][what do the readers use to manage]]
[[https://news.ycombinator.com/item?id=11070797][dotfiles]]. I was just experimenting with my method and contributed my [[https://news.ycombinator.com/item?id=11070970][two cents]]
. Turns out, rare for me, I stumbled upon an original way to edit, document
and deploy dotfiles. Although we Emacs users have been using Org-Mode to wrap
our .emacs and document our settings for years, few people that I know have
used it for managing more dotfiles.

There are at least 3 advantages of using Org-Mode to manage dotfiles, that I
can think of right now.

  * Every line of configuration can be documented. You can record why and when
    you add this line. You can also document other possible options for this
    particular setting right above or below the code block, so you don't
    always need to look up man pages or other documentation.
  * You need fewer error-prone symlinks. We have all been bitten by broken
    links when we were young and type 'ln -s dotfiles/vimrc ~/.vimrc', right?
    Even if we have learnt the lesson, and always use the full path, what if
    you want to migrate the dotfiles from BSD to Linux, where ~ mean different
    paths? I know, you set branches in your deployment script. Not a
    requirement with Org-Mode.
  * You can manage remote dotfiles. Org-Mode can 'tangle' code blocks to a
    remote location, thus you can manage your server's nginx.conf as easily as
    your .bashrc.

* 1 Here's how

** 1.1 Requirements

Emacs 24.x up, Org-Mode 8.x or newer, and Your favourite keyboard.

Open a new file in Emacs, call it dotfiles.org or whatever you like.

** 1.2 "Normal" dotfiles

These files directly reside under your home directory. So managing them in
Emacs is very straightforward. For ease of organization, you can put files of
the same category, e.g. all things related to email, under a heading:

#+BEGIN_SRC org
  ,* Email
  ,** Muttrc
  ,** Aliases
  ,** goobookrc
#+END_SRC

Then, under each subheading, put your files in an src block, like this:

#+BEGIN_SRC org
  ,* Email
  ,** Muttrc
   ,#+BEGIN_SRC conf :tangle ~/.muttrc
   #source "/etc/Muttrc"   # Not available on OS X
   source "gpg --batch --passphrase-file ~/.sec/.passphrase --textmode -d ~/.sec/mutt.gpg |"
   set realname="Haoyang Xu"

   set sig_dashes

   ...

   ,#+END_SRC
#+END_SRC

Then if you run M-x org-babel-tangle, or press C-c C-v t, the content of the
above src block will be written to $HOME/.muttrc, overwriting the file's
content if it exists already.

Similarly, write each file's content in an src block under the corresponding
subheading:

#+BEGIN_SRC org
  ,* Email
  ,** Muttrc ...
  ,** Aliases
    ,#+BEGIN_SRC conf :tangle ~/.aliases
    alias mumon      foobar@example.com
    ,#+END_SRC
  ,** goobookrc
    ,#+BEGIN_SRC conf :tangle ~/.goobookrc
    [DEFAULT]
       # The following are optional, defaults are shown

     # This file is written by the oauth library, and should be kept secure,
     # it's like a password to your google contacts.
     ;oauth_db_filename: ~/.goobook_auth.json

     # The client secret file is not really secret.
     ;client_secret_filename: ~/.goobook_client_secret.json

     ;cache_filename: ~/.goobook_cache
     ;cache_expiry_hours: 24
     ;filter_groupless_contacts: yes
    ,#+END_SRC
#+END_SRC

Now when you invoke org-babel-tangle, the 3 dotfiles will be written. You can
put the .org file under version control, edit the dotfiles within Emacs, and
deploy them with one command.

** 1.3 Dotfiles in a dotdir

For example, you want to manage your SSH config file, which is under .ssh.
Normally it will not be more difficult than the case above. But if you are
setting up a new machine and don't have .ssh path yet, Org-Mode will complain
when you tangle.

In that case, you can write a "magic" line at the beginning of the file:

#+BEGIN_SRC org
  # -*- eval: (make-directory ".ssh" "~") -*-
#+END_SRC

Alternatively, you can write an src block before the file content block to run
commands that create the directories needed.

#+BEGIN_SRC org
  ,#+BEGIN_SRC sh
  mkdir ~/.ssh
  ,#+END_SRC
#+END_SRC

The best approach may be setting a header argument mkdirp to yes, like this:

#+BEGIN_SRC org
  ,#+BEGIN_SRC sh :mkdirp yes :tangle ~/.ssh/config
  (your .ssh/config contents)
  ,#+END_SRC
#+END_SRC

If your .ssh directory does not exist yet when you tangle this block, Org-Mode
will create it for you.

