blog/2016/10/19/dotfile-management-and-documentation-with-org-mode/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Dotfile-Management-and-Documentation-with-Org-mode - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <link rel="stylesheet" href="http://lujun9972.github.io/emacs-document/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="http://lujun9972.github.io/emacs-document/media/css/comment.css" type="text/css"/>
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="http://lujun9972.github.io/emacs-document/">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="http://lujun9972.github.io/emacs-document/years/">Years</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/authors/">Authors</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/tags/">Tags</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Dotfile-Management-and-Documentation-with-Org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline6">1. 1 Here's how</a>
<ul>
<li><a href="#orgheadline1">1.1. 1.1 Requirements</a></li>
<li><a href="#orgheadline2">1.2. 1.2 "Normal" dotfiles</a></li>
<li><a href="#orgheadline3">1.3. 1.3 Dotfiles in a dotdir</a></li>
<li><a href="#orgheadline4">1.4. 1.4 Emacs dotfiles</a></li>
<li><a href="#orgheadline5">1.5. 1.5 Credentials and secrets</a></li>
</ul>
</li>
<li><a href="#orgheadline7">2. 2 Documenting changes</a></li>
<li><a href="#orgheadline8">3. 3 Managing remote dotfiles and configs</a></li>
<li><a href="#orgheadline9">4. 4 Caveats</a></li>
<li><a href="#orgheadline10">5. 5 Acknowledgements</a></li>
</ul>
</div>
</div>
<p>
One day 'polm23' asked on Hacker News, <a href="https://news.ycombinator.com/item?id=11070797">what do the readers use to manage</a>
<a href="https://news.ycombinator.com/item?id=11070797">dotfiles</a>. I was just experimenting with my method and contributed my <a href="https://news.ycombinator.com/item?id=11070970">two cents</a>
. Turns out, rare for me, I stumbled upon an original way to edit, document
and deploy dotfiles. Although we Emacs users have been using Org-Mode to wrap
our .emacs and document our settings for years, few people that I know have
used it for managing more dotfiles.
</p>

<p>
There are at least 3 advantages of using Org-Mode to manage dotfiles, that I
can think of right now.
</p>

<ul class="org-ul">
<li>Every line of configuration can be documented. You can record why and when
you add this line. You can also document other possible options for this
particular setting right above or below the code block, so you don't
always need to look up man pages or other documentation.</li>
<li>You need fewer error-prone symlinks. We have all been bitten by broken
links when we were young and type 'ln -s dotfiles/vimrc ~/.vimrc', right?
Even if we have learnt the lesson, and always use the full path, what if
you want to migrate the dotfiles from BSD to Linux, where ~ mean different
paths? I know, you set branches in your deployment script. Not a
requirement with Org-Mode.</li>
<li>You can manage remote dotfiles. Org-Mode can 'tangle' code blocks to a
remote location, thus you can manage your server's nginx.conf as easily as
your .bashrc.</li>
</ul>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">1</span> 1 Here's how</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 1.1 Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Emacs 24.x up, Org-Mode 8.x or newer, and Your favourite keyboard.
</p>

<p>
Open a new file in Emacs, call it dotfiles.org or whatever you like.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 1.2 "Normal" dotfiles</h3>
<div class="outline-text-3" id="text-1-2">
<p>
These files directly reside under your home directory. So managing them in
Emacs is very straightforward. For ease of organization, you can put files of
the same category, e.g. all things related to email, under a heading:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Email</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Muttrc</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Aliases</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* goobookrc</span>
</pre>
</div>

<p>
Then, under each subheading, put your files in an src block, like this:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Email</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Muttrc</span>
<span style="color: #827591; background-color: #373040;"> #+BEGIN_SRC conf :tangle ~/.muttrc</span>
 <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">source "/etc/Muttrc"   # Not available on OS X</span>
 <span style="color: #7590db;">source</span> <span style="color: #2d9574;">"gpg --batch --passphrase-file ~/.sec/.passphrase --textmode -d ~/.sec/mutt.gpg |"</span>
 <span style="color: #7590db;">set</span> realname=<span style="color: #2d9574;">"Haoyang Xu"</span>

 <span style="color: #7590db;">set</span> sig_dashes

 <span style="color: #7590db;">...</span>

<span style="color: #827591; background-color: #373040;"> #+END_SRC</span>
</pre>
</div>

<p>
Then if you run M-x org-babel-tangle, or press C-c C-v t, the content of the
above src block will be written to $HOME/.muttrc, overwriting the file's
content if it exists already.
</p>

<p>
Similarly, write each file's content in an src block under the corresponding
subheading:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Email</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Muttrc ...</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Aliases</span>
<span style="color: #827591; background-color: #373040;">  #+BEGIN_SRC conf :tangle ~/.aliases</span>
  <span style="color: #7590db;">alias</span> mumon      foobar@example.com
<span style="color: #827591; background-color: #373040;">  #+END_SRC</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* goobookrc</span>
<span style="color: #827591; background-color: #373040;">  #+BEGIN_SRC conf :tangle ~/.goobookrc</span>
  [<span style="color: #ce537a; font-weight: bold;">DEFAULT</span>]
     # The following are optional, defaults are shown

   # This file is written by the oauth library, and should be kept secure,
   # it's like a password to your google contacts.
   ;oauth_db_filename: ~/.goobook_auth.json

   # The client secret file is not really secret.
   ;client_secret_filename: ~/.goobook_client_secret.json

   ;cache_filename: ~/.goobook_cache
   ;cache_expiry_hours: 24
   ;filter_groupless_contacts: yes
<span style="color: #827591; background-color: #373040;">  #+END_SRC</span>
</pre>
</div>

<p>
Now when you invoke org-babel-tangle, the 3 dotfiles will be written. You can
put the .org file under version control, edit the dotfiles within Emacs, and
deploy them with one command.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> 1.3 Dotfiles in a dotdir</h3>
<div class="outline-text-3" id="text-1-3">
<p>
For example, you want to manage your SSH config file, which is under .ssh.
Normally it will not be more difficult than the case above. But if you are
setting up a new machine and don't have .ssh path yet, Org-Mode will complain
when you tangle.
</p>

<p>
In that case, you can write a "magic" line at the beginning of the file:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #2aa1ae; background-color: #292e34;"># -*- eval: (make-directory ".ssh" "~") -*-</span>
</pre>
</div>

<p>
Alternatively, you can write an src block before the file content block to run
commands that create the directories needed.
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_SRC sh</span>
mkdir ~/.ssh
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
The best approach may be setting a header argument mkdirp to yes, like this:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_SRC sh :mkdirp yes :tangle ~/.ssh/config</span>
<span style="color: #4f97d7;">(</span>your .ssh/config contents<span style="color: #4f97d7;">)</span>
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
If your .ssh directory does not exist yet when you tangle this block, Org-Mode
will create it for you.
</p>
</div>
</div>
