raw/Dotfile-Management-and-Documentation-with-Org-mode.org
** 1.4 Emacs dotfiles

If your are using the good old .emacs or init.el to store your Emacs
configuration, they are managed in the same manner as the above cases.
However, if your configuration are already living in another .org file, you
probably don't want to put it in an "org" src block in your dotfile.org. My
solution is to put it in a directory under the directory where my home.org (my
dotfile) resides. That makes it a little untidy but I don't have a better
solution right now. Ah, the taste of irony.

** 1.5 Credentials and secrets

If you are putting your dotfiles online, you need to save dotfiles with
passwords/secrets in an encrypted format. Luckily, Emacs has very good
encryption/decryption support. You can put things you don't want others to
read into a specific .org file, and use epa-encrypt-file to get encrypted file
with .gpg suffix. After that you can delete the clear text .org file. Next
time when you edit the encrypted .org.gpg file, Emacs will use gpg-agent to
ask for the password, and decrypt it for you.

* 2 Documenting changes

The above method provides a simple and fast way to put all your dotfiles in a
few .org files. But it does not fully justify a migration of all your dotfiles
into Org-mode src blocks. The strength of Org-mode based dotfile management
lies in seamless documentation and instant deploy of changes.

It is possible to breakdown a very long config file into multiple src blocks,
and tangle them into one file for deployment. These src blocks can even be put
into different subheadings, according to their categories and functions in the
final tangled config.

In this case, the file to write to is not specified in each src block's
attributes ('head arguments', as in the official document), but as a property
of the subheading under which the contents of the file goes. It is better to
illustrate with an example:

#+BEGIN_SRC org
  ,* Git
    :PROPERTIES:
    :tangle:   ~/.gitconfig   # <- all src blocks under this 'Git' subtree will be written to ~/.gitconfig
    :END:
  ,** personal information
  ,#+BEGIN_SRC conf
      [user]
          name = John Doe
    email = john.doe@example.net
  ,#+END_SRC
  ,** push settings
  ,#+BEGIN_SRC conf
      [push]
          default = upstream
  ,#+END_SRC
  ...
#+END_SRC

When you tangle this file, all src blocks under * Git subtree will be tangled
into $HOME/.gitconfig.

Now, suppose we want to change Git's push settings, it is easy to locate that
subtree, and do some editing.

#+BEGIN_SRC org
  ,** push settings
  ,#+BEGIN_SRC conf
      [push]
          default = simple
  ,#+END_SRC
#+END_SRC

It may become difficult to tell which part gets edited after a while. Why not
write a little note about the change?

#+BEGIN_SRC org
  ,** push settings
  ,#+BEGIN_SRC conf
      [push]
          default = simple
  ,#+END_SRC
  [2016-03-19 Sat 22:31] change push default from 'upstream' to 'simple'.
#+END_SRC

The timestamp can be inserted almost anywhere, by pressing C-u C-c !. If you
only need to remember the date but not the time, you can use C-c !.

If you often need to change such settings, it is a good idea to document all
possible options:

#+BEGIN_SRC org
  ,** push settings
     With ~push.default~ set to ~simple~, ~git push~ will fail if the current local branch is not tracking a remote branch, even if remote has a branch with the same name. This seems to be the safest option. Other possible values are:

   - ~upstream~: push the local branch to its upstream branch.
   - ~current~: push the local branch to a branch of the same name.

  ,#+BEGIN_SRC conf
      [push]
          default = simple
  ,#+END_SRC
  [2016-03-19 Sat 22:31] change push default from 'upstream' to 'simple'.
#+END_SRC

In other cases, you may want to experiment with various combinations of
options. You can write them all out, and tell Org-Mode not to tangle some of
them:

#+BEGIN_SRC conf :tangle no
safe_threshold=1
encryption_mechanism=ECDHE_RSA
#+END_SRC

#+BEGIN_SRC conf
safe_threshold=0
encryption_mechanism=HMAC-SHA1
#+END_SRC

Only the latter config will enter the config file.

* 3 Managing remote dotfiles and configs

In :tangle head argument or subtree property, you can specify a remote
location, typically a remote server which you have SSH access. Suppose you are
in charge of a web server, you can save yourself a lot of remote editing by
using Org-Mode to manage its configuration:

#+BEGIN_SRC org
  ,* Nginx
    :PROPERTIES:
    :tangle:   /webadmin@ssh.example.org:configs/nginx.conf
  ,#+BEGIN_SRC conf
    worker_processes 4;

    events { worker_connections 1024; }
    ...
  ,#+END_SRC

  ,#+BEGIN_SRC sh :dir /ssh:webadmin@ssh.example.org|sudo:ssh.example.org :tangle no
  cp /home/webadmin/configs/nginx.conf /etc/nginx/
  chown nginx:nginx /etc/nginx/nginx.conf
  ,#+END_SRC
#+END_SRC

The first code block get tangled into the remote file /home/webadmin/
nginx.conf, the second code block has :tangle no and will not be tangled into
any file, but you can run the code block from your local Emacs, it will ask
you your sudo password, and copy the file to the right location and set
owners.

