blog/2016/10/19/dotfile-management-and-documentation-with-org-mode/index.html

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> 1.4 Emacs dotfiles</h3>
<div class="outline-text-3" id="text-1-4">
<p>
If your are using the good old .emacs or init.el to store your Emacs
configuration, they are managed in the same manner as the above cases.
However, if your configuration are already living in another .org file, you
probably don't want to put it in an "org" src block in your dotfile.org. My
solution is to put it in a directory under the directory where my home.org (my
dotfile) resides. That makes it a little untidy but I don't have a better
solution right now. Ah, the taste of irony.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> 1.5 Credentials and secrets</h3>
<div class="outline-text-3" id="text-1-5">
<p>
If you are putting your dotfiles online, you need to save dotfiles with
passwords/secrets in an encrypted format. Luckily, Emacs has very good
encryption/decryption support. You can put things you don't want others to
read into a specific .org file, and use epa-encrypt-file to get encrypted file
with .gpg suffix. After that you can delete the clear text .org file. Next
time when you edit the encrypted .org.gpg file, Emacs will use gpg-agent to
ask for the password, and decrypt it for you.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> 2 Documenting changes</h2>
<div class="outline-text-2" id="text-2">
<p>
The above method provides a simple and fast way to put all your dotfiles in a
few .org files. But it does not fully justify a migration of all your dotfiles
into Org-mode src blocks. The strength of Org-mode based dotfile management
lies in seamless documentation and instant deploy of changes.
</p>

<p>
It is possible to breakdown a very long config file into multiple src blocks,
and tangle them into one file for deployment. These src blocks can even be put
into different subheadings, according to their categories and functions in the
final tangled config.
</p>

<p>
In this case, the file to write to is not specified in each src block's
attributes ('head arguments', as in the official document), but as a property
of the subheading under which the contents of the file goes. It is better to
illustrate with an example:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Git</span>
<span style="color: #bc6ec5;">  :PROPERTIES:</span>
  <span style="color: #bc6ec5;">:tangle:</span>   ~/.gitconfig   # &lt;- all src blocks under this 'Git' subtree will be written to ~/.gitconfig
<span style="color: #bc6ec5;">  :END:</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* personal information</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
    [<span style="color: #ce537a; font-weight: bold;">user</span>]
        <span style="color: #7590db;">name</span> = John Doe
  <span style="color: #7590db;">email</span> = john.doe@example.net
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
    [<span style="color: #ce537a; font-weight: bold;">push</span>]
        <span style="color: #7590db;">default</span> = upstream
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
...
</pre>
</div>

<p>
When you tangle this file, all src blocks under * Git subtree will be tangled
into $HOME/.gitconfig.
</p>

<p>
Now, suppose we want to change Git's push settings, it is easy to locate that
subtree, and do some editing.
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
    [<span style="color: #ce537a; font-weight: bold;">push</span>]
        <span style="color: #7590db;">default</span> = simple
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
It may become difficult to tell which part gets edited after a while. Why not
write a little note about the change?
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
    [<span style="color: #ce537a; font-weight: bold;">push</span>]
        <span style="color: #7590db;">default</span> = simple
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
<span style="color: #7590db; text-decoration: underline;">[2016-03-19 Sat 22:31]</span> change push default from 'upstream' to 'simple'.
</pre>
</div>

<p>
The timestamp can be inserted almost anywhere, by pressing C-u C-c !. If you
only need to remember the date but not the time, you can use C-c !.
</p>

<p>
If you often need to change such settings, it is a good idea to document all
possible options:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
   With <span style="color: #28def0;">~push.default~</span> set to <span style="color: #28def0;">~simple~</span>, <span style="color: #28def0;">~git push~</span> will fail if the current local branch is not tracking a remote branch, even if remote has a branch with the same name. This seems to be the safest option. Other possible values are:

 - <span style="color: #28def0;">~upstream~</span>: push the local branch to its upstream branch.
 - <span style="color: #28def0;">~current~</span>: push the local branch to a branch of the same name.

<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
    [<span style="color: #ce537a; font-weight: bold;">push</span>]
        <span style="color: #7590db;">default</span> = simple
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
<span style="color: #7590db; text-decoration: underline;">[2016-03-19 Sat 22:31]</span> change push default from 'upstream' to 'simple'.
</pre>
</div>

<p>
In other cases, you may want to experiment with various combinations of
options. You can write them all out, and tell Org-Mode not to tangle some of
them:
</p>

<div class="org-src-container">

<pre class="src src-conf"><span style="color: #7590db;">safe_threshold</span>=1
<span style="color: #7590db;">encryption_mechanism</span>=ECDHE_RSA
</pre>
</div>

<div class="org-src-container">

<pre class="src src-conf"><span style="color: #7590db;">safe_threshold</span>=0
<span style="color: #7590db;">encryption_mechanism</span>=HMAC-SHA1
</pre>
</div>

<p>
Only the latter config will enter the config file.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">3</span> 3 Managing remote dotfiles and configs</h2>
<div class="outline-text-2" id="text-3">
<p>
In :tangle head argument or subtree property, you can specify a remote
location, typically a remote server which you have SSH access. Suppose you are
in charge of a web server, you can save yourself a lot of remote editing by
using Org-Mode to manage its configuration:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Nginx</span>
<span style="color: #bc6ec5;">  :PROPERTIES:</span>
  <span style="color: #bc6ec5;">:tangle:</span>   /webadmin@ssh.example.org:configs/nginx.conf
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  <span style="color: #7590db;">worker_processes</span> 4;

  <span style="color: #7590db;">events</span> { worker_connections 1024; }
  <span style="color: #7590db;">...</span>
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>

<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC sh :dir /ssh:webadmin@ssh.example.org|sudo:ssh.example.org :tangle no</span>
cp /home/webadmin/configs/nginx.conf /etc/nginx/
chown nginx:nginx /etc/nginx/nginx.conf
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
The first code block get tangled into the remote file <i>home/webadmin</i>
nginx.conf, the second code block has :tangle no and will not be tangled into
any file, but you can run the code block from your local Emacs, it will ask
you your sudo password, and copy the file to the right location and set
owners.
</p>
</div>
</div>
